---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NestedLoops
source: html/7f1a1233-106e-a5d2-0519-e43b52349e9c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NestedLoops Property

Cannot have nested loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId NestedLoops { get; }
```